sukawatd/Arduino_Tony/boards.txt
menu.UploadSpeed=Upload Speed
menu.CPUFreq=CPU Frequency
menu.FlashFreq=Flash Frequency
menu.FlashMode=Flash Mode
menu.FlashSize=Flash Size
menu.PartitionScheme=Partition Scheme
menu.DebugLevel=Core Debug Level
menu.PSRAM=PSRAM
menu.Revision=Board Revision

##############################################################

tony32pro.name=TonySX E32 pro

tony32pro.upload.tool=esptool_py
tony32pro.upload.maximum_size=1310720
tony32pro.upload.maximum_data_size=327680
tony32pro.upload.wait_for_upload_port=true

tony32pro.serial.disableDTR=true
tony32pro.serial.disableRTS=true

tony32pro.build.mcu=esp32
tony32pro.build.core=esp32
tony32pro.build.variant=tonyE32pro
tony32pro.build.board=ESP32_DEV

tony32pro.build.f_cpu=240000000L
tony32pro.build.flash_size=4MB
tony32pro.build.flash_freq=40m
tony32pro.build.flash_mode=dio
tony32pro.build.boot=dio
tony32pro.build.partitions=default
tony32pro.build.defines=-DBOARD_HAS_PSRAM -mfix-esp32-psram-cache-issue

tony32pro.menu.PartitionScheme.default=Default 4MB with spiffs (1.2MB APP/1.5MB SPIFFS)
tony32pro.menu.PartitionScheme.default.build.partitions=default
tony32pro.menu.PartitionScheme.defaultffat=Default 4MB with ffat (1.2MB APP/1.5MB FATFS)
tony32pro.menu.PartitionScheme.defaultffat.build.partitions=default_ffat
tony32pro.menu.PartitionScheme.default_8MB=8M Flash (3MB APP/1.5MB FAT)
tony32pro.menu.PartitionScheme.default_8MB.build.partitions=default_8MB
tony32pro.menu.PartitionScheme.minimal=Minimal (1.3MB APP/700KB SPIFFS)
tony32pro.menu.PartitionScheme.minimal.build.partitions=minimal
tony32pro.menu.PartitionScheme.no_ota=No OTA (2MB APP/2MB SPIFFS)
tony32pro.menu.PartitionScheme.no_ota.build.partitions=no_ota
tony32pro.menu.PartitionScheme.no_ota.upload.maximum_size=2097152
tony32pro.menu.PartitionScheme.noota_3g=No OTA (1MB APP/3MB SPIFFS)
tony32pro.menu.PartitionScheme.noota_3g.build.partitions=noota_3g
tony32pro.menu.PartitionScheme.noota_3g.upload.maximum_size=1048576
tony32pro.menu.PartitionScheme.noota_ffat=No OTA (2MB APP/2MB FATFS)
tony32pro.menu.PartitionScheme.noota_ffat.build.partitions=noota_ffat
tony32pro.menu.PartitionScheme.noota_ffat.upload.maximum_size=2097152
tony32pro.menu.PartitionScheme.noota_3gffat=No OTA (1MB APP/3MB FATFS)
tony32pro.menu.PartitionScheme.noota_3gffat.build.partitions=noota_3gffat
tony32pro.menu.PartitionScheme.noota_3gffat.upload.maximum_size=1048576
tony32pro.menu.PartitionScheme.huge_app=Huge APP (3MB No OTA/1MB SPIFFS)
tony32pro.menu.PartitionScheme.huge_app.build.partitions=huge_app
tony32pro.menu.PartitionScheme.huge_app.upload.maximum_size=3145728
tony32pro.menu.PartitionScheme.min_spiffs=Minimal SPIFFS (1.9MB APP with OTA/190KB SPIFFS)
tony32pro.menu.PartitionScheme.min_spiffs.build.partitions=min_spiffs
tony32pro.menu.PartitionScheme.min_spiffs.upload.maximum_size=1966080
tony32pro.menu.PartitionScheme.fatflash=16M Flash (2MB APP/12.5MB FAT)
tony32pro.menu.PartitionScheme.fatflash.build.partitions=ffat

tony32pro.menu.FlashMode.qio=QIO
tony32pro.menu.FlashMode.qio.build.flash_mode=dio
tony32pro.menu.FlashMode.qio.build.boot=qio
tony32pro.menu.FlashMode.dio=DIO
tony32pro.menu.FlashMode.dio.build.flash_mode=dio
tony32pro.menu.FlashMode.dio.build.boot=dio
tony32pro.menu.FlashMode.qout=QOUT
tony32pro.menu.FlashMode.qout.build.flash_mode=dout
tony32pro.menu.FlashMode.qout.build.boot=qout
tony32pro.menu.FlashMode.dout=DOUT
tony32pro.menu.FlashMode.dout.build.flash_mode=dout
tony32pro.menu.FlashMode.dout.build.boot=dout

tony32pro.menu.FlashFreq.80=80MHz
tony32pro.menu.FlashFreq.80.build.flash_freq=80m
tony32pro.menu.FlashFreq.40=40MHz
tony32pro.menu.FlashFreq.40.build.flash_freq=40m

tony32pro.menu.UploadSpeed.921600=921600
tony32pro.menu.UploadSpeed.921600.upload.speed=921600
tony32pro.menu.UploadSpeed.115200=115200
tony32pro.menu.UploadSpeed.115200.upload.speed=115200
tony32pro.menu.UploadSpeed.256000.windows=256000
tony32pro.menu.UploadSpeed.256000.upload.speed=256000
tony32pro.menu.UploadSpeed.230400.windows.upload.speed=256000
tony32pro.menu.UploadSpeed.230400=230400
tony32pro.menu.UploadSpeed.230400.upload.speed=230400
tony32pro.menu.UploadSpeed.460800.linux=460800
tony32pro.menu.UploadSpeed.460800.macosx=460800
tony32pro.menu.UploadSpeed.460800.upload.speed=460800
tony32pro.menu.UploadSpeed.512000.windows=512000
tony32pro.menu.UploadSpeed.512000.upload.speed=512000

tony32pro.menu.DebugLevel.none=None
tony32pro.menu.DebugLevel.none.build.code_debug=0
tony32pro.menu.DebugLevel.error=Error
tony32pro.menu.DebugLevel.error.build.code_debug=1
tony32pro.menu.DebugLevel.warn=Warn
tony32pro.menu.DebugLevel.warn.build.code_debug=2
tony32pro.menu.DebugLevel.info=Info
tony32pro.menu.DebugLevel.info.build.code_debug=3
tony32pro.menu.DebugLevel.debug=Debug
tony32pro.menu.DebugLevel.debug.build.code_debug=4
tony32pro.menu.DebugLevel.verbose=Verbose
tony32pro.menu.DebugLevel.verbose.build.code_debug=5

##############################################################
